In [9]:
import pandas as pd
from sklearn.preprocessing import StandardScaler
from sklearn.preprocessing import MinMaxScaler
import numpy as np

In [6]:
data = {
    "Age": [25, 30, 45, 50],
    "Salary": [30000, 50000, 80000, 120000],
    "YearsExperience": [1, 5, 20, 25]
}

df = pd.DataFrame(data)
df

   Age  Salary  YearsExperience
0   25   30000                1
1   30   50000                5
2   45   80000               20
3   50  120000               25

In [7]:
scaler = StandardScaler()
scaled_data = scaler.fit_transform(df)
scaled_df = pd.DataFrame(scaled_data, columns=df.columns)
scaled_df

        Age    Salary  YearsExperience
0 -1.212678 -1.179536        -1.173900
1 -0.727607 -0.589768        -0.774274
2  0.727607  0.294884         0.724321
3  1.212678  1.474420         1.223853

In [12]:
scaler = MinMaxScaler()
scaled_data = scaler.fit_transform(df)
scaled_df = pd.DataFrame(scaled_data, columns=df.columns)
print(scaled_df)

   Age    Salary  YearsExperience
0  0.0  0.000000         0.000000
1  0.2  0.222222         0.166667
2  0.8  0.555556         0.791667
3  1.0  1.000000         1.000000

NameError: name 'normalized_data' is not defined